src/cf/DataProcessors/ЭлектронныеПеревозочныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЭлектронныеПеревозочныеДокументы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиДополнительныхРеквизитовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДополнительныхРеквизитовЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квалификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перечисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ЭлектронныеПеревозочныеДокументы/Forms/ФормаНастройкиПоиска/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Предустановленные поля
	СтрокаПоиска = ПоляПоиска.Добавить();
	СтрокаПоиска.Значение = "Водитель.СерияВУ,Водитель.НомерВУ";
	СтрокаПоиска.Представление = "Водительское удостоверение";
	
	СтрокаПоиска = ПоляПоиска.Добавить();
	СтрокаПоиска.Значение = "Водитель.Фамилия,Водитель.Имя,Водитель.Отчество";
	СтрокаПоиска.Представление = "ФИО водителя";
	
	СтрокаПоиска = ПоляПоиска.Добавить();
	СтрокаПоиска.Значение = "ТранспортноеСредство.РегистрационныйНомер";
	СтрокаПоиска.Представление = "Гос. номер автомобиля";
	
	СтрокаПоиска = ПоляПоиска.Добавить();
	СтрокаПоиска.Значение = "Груз.ОтгрузочноеНаименованиеГруза";
	СтрокаПоиска.Представление = "Наименование груза";
	
	// Дополнительные пользовательские реквизиты
	Если ОбменСГИСЭПДКлиентСервер.ИспользуютсяДополнительныеРеквизитыЭПД() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НастройкиДополнительныхРеквизитовЭПД.ГруппаДанных,
		|	НастройкиДополнительныхРеквизитовЭПД.ИдентификаторИнформации,
		|	НастройкиДополнительныхРеквизитовЭПД.ТипДанных,
		|	НастройкиДополнительныхРеквизитовЭПД.Заголовок
		|ИЗ
		|	РегистрСведений.НастройкиДополнительныхРеквизитовЭПД КАК НастройкиДополнительныхРеквизитовЭПД";
		Выборка = Запрос.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			СтрокаПоиска = ПоляПоиска.Добавить();
			СтрокаПоиска.Значение = Выборка.ГруппаДанных + "ДополнительнаяИнформация.Значение|" 
				+ Выборка.ТипДанных + "|" + Выборка.ИдентификаторИнформации;
			СтрокаПоиска.Представление = Выборка.Заголовок;	
		КонецЦикла;
	КонецЕсли;	
	
	// Переданные при открытии формы поля
	Если Параметры.Свойство("ПоляПоиска") Тогда
		ПоискПоВыборочнымПолям = ?(Параметры.ПоляПоиска.Количество() > 0, 1, 0);
		Для Каждого Поле Из Параметры.ПоляПоиска Цикл
			ПолеЕстьВСписке = Ложь;
			Для Каждого ЭлементСписка Из ПоляПоиска Цикл
				Если ЗначениеЗаполнено(Поле.Значение) 
				И СтрНайти(ЭлементСписка.Значение, Поле.Значение) Тогда
					ЭлементСписка.Пометка = Поле.Пометка;
					ПолеЕстьВСписке = Истина;
				КонецЕсли;
			КонецЦикла;
			Если ПолеЕстьВСписке = Ложь Тогда
				СтрокаПоиска = ПоляПоиска.Добавить();
				СтрокаПоиска.Значение = Поле.Значение;
				СтрокаПоиска.Представление = Поле.Представление;
				СтрокаПоиска.Пометка = Поле.Пометка;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СтрокаПоиска = ПоляПоиска.Добавить();
	СтрокаПоиска.Кнопка = "Еще...";
	
	Элементы.ПоляПоиска.Доступность = ПоискПоВыборочнымПолям = 1;

КонецПроцедуры

&НаКлиенте
Процедура ПоляПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПоляПоискаКнопка" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПоляПоиска", СписокПолейПоТаблице());
		
		ПоляПоискаПередНачаломДобавления_Завершение = Новый ОписаниеОповещения("ПоляПоискаПередНачаломДобавления_Завершение", ЭтотОбъект);
		
		ОткрытьФорму("Обработка.ЭлектронныеПеревозочныеДокументы.Форма.ФормаВыбораПолейПоиска", 
			ПараметрыФормы, 
			ЭтотОбъект, 
			УникальныйИдентификатор, , , 
			ПоляПоискаПередНачаломДобавления_Завершение, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоляПоискаПередНачаломДобавления_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СтрокаПоиска = ПоляПоиска.Вставить(ПоляПоиска.Количество() - 1);
		СтрокаПоиска.Значение = Результат.Значение + "|" + Результат.ТипДанных;
		СтрокаПоиска.Представление = Результат.Представление;
		СтрокаПоиска.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоВыборочнымПолямПриИзменении(Элемент)
	
	Элементы.ПоляПоиска.Доступность = ПоискПоВыборочнымПолям = 1;
	
КонецПроцедуры

&НаКлиенте
Функция СписокПолейПоТаблице()
	
	Результат = Новый СписокЗначений;
	Для Каждого СтрокаПоиска Из ПоляПоиска Цикл
		Если ЗначениеЗаполнено(СтрокаПоиска.Значение) Тогда
			Если ПоискПоВыборочнымПолям = 0 Тогда 
				СтрокаПоиска.Пометка = Ложь;	
			КонецЕсли;
			Результат.Добавить(СтрокаПоиска.Значение, СтрокаПоиска.Представление, СтрокаПоиска.Пометка);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СписокПолейПоТаблице());

КонецПроцедуры
